; domain
(define (domain gripper)

    (:requirements
          :strips
          :typing
          :negative-preconditions
          :equality
    )

   (:types room ball gripper)

   (:predicates (at-robby ?r - room)
		(at ?b - ball ?r - room)
		(free ?g - gripper)
		(carry ?o - ball ?g - gripper))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (and (at-robby ?from))
       :effect (and  (at-robby ?to)
		     (not (at-robby ?from))))

   (:action pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?room) (free ?gripper))
       :effect (and (carry ?obj ?gripper)
		    (not (at ?obj ?room))
		    (not (free ?gripper))))


   (:action drop
       :parameters  (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (carry ?obj ?gripper) (at-robby ?room))
       :effect (and (at ?obj ?room)
		    (free ?gripper)
		    (not (carry ?obj ?gripper))))
)

; problem
(define (problem p11)
(:domain gripper)
(:objects
rooma roomb - room
right left - gripper
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 ball41 ball42 ball43 ball44 ball45 ball46 ball47 ball48 ball49 ball50 ball51 ball52 ball53 ball54 ball55 ball56 ball57 ball58 ball59 ball60 ball61 ball62 ball63 ball64 ball65 ball66 - ball
)
(:init
(at-robby rooma)
(free right)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at ball37 rooma)
(at ball38 rooma)
(at ball39 rooma)
(at ball40 rooma)
(at ball41 rooma)
(at ball42 rooma)
(at ball43 rooma)
(at ball44 rooma)
(at ball45 rooma)
(at ball46 rooma)
(at ball47 rooma)
(at ball48 rooma)
(at ball49 rooma)
(at ball50 rooma)
(at ball51 rooma)
(at ball52 rooma)
(at ball53 rooma)
(at ball54 rooma)
(at ball55 rooma)
(at ball56 rooma)
(at ball57 rooma)
(at ball58 rooma)
(at ball59 rooma)
(at ball60 rooma)
(at ball61 rooma)
(at ball62 rooma)
(at ball63 rooma)
(at ball64 rooma)
(at ball65 rooma)
(at ball66 rooma)
)
(:goal (and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
(at ball38 roomb)
(at ball39 roomb)
(at ball40 roomb)
(at ball41 roomb)
(at ball42 roomb)
(at ball43 roomb)
(at ball44 roomb)
(at ball45 roomb)
(at ball46 roomb)
(at ball47 roomb)
(at ball48 roomb)
(at ball49 roomb)
(at ball50 roomb)
(at ball51 roomb)
(at ball52 roomb)
(at ball53 roomb)
(at ball54 roomb)
(at ball55 roomb)
(at ball56 roomb)
(at ball57 roomb)
(at ball58 roomb)
(at ball59 roomb)
(at ball60 roomb)
(at ball61 roomb)
(at ball62 roomb)
(at ball63 roomb)
(at ball64 roomb)
(at ball65 roomb)
(at ball66 roomb)
))
)

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 0 of 66
2. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 0 of 66
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 66
4. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 1 of 66
5. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 2 of 66
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 66
7. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 2 of 66
8. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 2 of 66
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 66
10. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 3 of 66
11. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 4 of 66
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 4 of 66
13. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 4 of 66
14. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 4 of 66
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 66
16. (drop ball5 roomb right)
   deleted: (carry ball5 right)
   added: (at ball5 roomb) (free right)
   goals met: 5 of 66
17. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 6 of 66
18. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 66
19. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 6 of 66
20. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 6 of 66
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 66
22. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 7 of 66
23. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 8 of 66
24. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 66
25. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 8 of 66
26. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 8 of 66
27. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 66
28. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 9 of 66
29. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 10 of 66
30. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 66
31. (pick ball11 rooma right)
   deleted: (at ball11 rooma) (free right)
   added: (carry ball11 right)
   goals met: 10 of 66
32. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 10 of 66
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 66
34. (drop ball11 roomb right)
   deleted: (carry ball11 right)
   added: (at ball11 roomb) (free right)
   goals met: 11 of 66
35. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 12 of 66
36. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 66
37. (pick ball13 rooma right)
   deleted: (at ball13 rooma) (free right)
   added: (carry ball13 right)
   goals met: 12 of 66
38. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 12 of 66
39. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 66
40. (drop ball13 roomb right)
   deleted: (carry ball13 right)
   added: (at ball13 roomb) (free right)
   goals met: 13 of 66
41. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 14 of 66
42. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 66
43. (pick ball15 rooma right)
   deleted: (at ball15 rooma) (free right)
   added: (carry ball15 right)
   goals met: 14 of 66
44. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 14 of 66
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 66
46. (drop ball15 roomb right)
   deleted: (carry ball15 right)
   added: (at ball15 roomb) (free right)
   goals met: 15 of 66
47. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 16 of 66
48. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 66
49. (pick ball17 rooma right)
   deleted: (at ball17 rooma) (free right)
   added: (carry ball17 right)
   goals met: 16 of 66
50. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 16 of 66
51. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 66
52. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 17 of 66
53. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 18 of 66
54. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 66
55. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 18 of 66
56. (pick ball20 rooma right)
   deleted: (at ball20 rooma) (free right)
   added: (carry ball20 right)
   goals met: 18 of 66
57. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 66
58. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 19 of 66
59. (drop ball20 roomb right)
   deleted: (carry ball20 right)
   added: (at ball20 roomb) (free right)
   goals met: 20 of 66
60. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 66
61. (pick ball21 rooma right)
   deleted: (at ball21 rooma) (free right)
   added: (carry ball21 right)
   goals met: 20 of 66
62. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 20 of 66
63. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 66
64. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 21 of 66
65. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 22 of 66
66. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 66
67. (pick ball23 rooma right)
   deleted: (at ball23 rooma) (free right)
   added: (carry ball23 right)
   goals met: 22 of 66
68. (pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 22 of 66
69. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 66
70. (drop ball23 roomb right)
   deleted: (carry ball23 right)
   added: (at ball23 roomb) (free right)
   goals met: 23 of 66
71. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 24 of 66
72. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 66
73. (pick ball25 rooma right)
   deleted: (at ball25 rooma) (free right)
   added: (carry ball25 right)
   goals met: 24 of 66
74. (pick ball26 rooma left)
   deleted: (at ball26 rooma) (free left)
   added: (carry ball26 left)
   goals met: 24 of 66
75. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 66
76. (drop ball25 roomb right)
   deleted: (carry ball25 right)
   added: (at ball25 roomb) (free right)
   goals met: 25 of 66
77. (drop ball26 roomb left)
   deleted: (carry ball26 left)
   added: (at ball26 roomb) (free left)
   goals met: 26 of 66
78. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 66
79. (pick ball27 rooma right)
   deleted: (at ball27 rooma) (free right)
   added: (carry ball27 right)
   goals met: 26 of 66
80. (pick ball28 rooma left)
   deleted: (at ball28 rooma) (free left)
   added: (carry ball28 left)
   goals met: 26 of 66
81. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 66
82. (drop ball27 roomb right)
   deleted: (carry ball27 right)
   added: (at ball27 roomb) (free right)
   goals met: 27 of 66
83. (drop ball28 roomb left)
   deleted: (carry ball28 left)
   added: (at ball28 roomb) (free left)
   goals met: 28 of 66
84. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 66
85. (pick ball29 rooma right)
   deleted: (at ball29 rooma) (free right)
   added: (carry ball29 right)
   goals met: 28 of 66
86. (pick ball30 rooma left)
   deleted: (at ball30 rooma) (free left)
   added: (carry ball30 left)
   goals met: 28 of 66
87. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 66
88. (drop ball29 roomb right)
   deleted: (carry ball29 right)
   added: (at ball29 roomb) (free right)
   goals met: 29 of 66
89. (drop ball30 roomb left)
   deleted: (carry ball30 left)
   added: (at ball30 roomb) (free left)
   goals met: 30 of 66
90. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 66
91. (pick ball31 rooma right)
   deleted: (at ball31 rooma) (free right)
   added: (carry ball31 right)
   goals met: 30 of 66
92. (pick ball32 rooma left)
   deleted: (at ball32 rooma) (free left)
   added: (carry ball32 left)
   goals met: 30 of 66
93. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 66
94. (drop ball31 roomb right)
   deleted: (carry ball31 right)
   added: (at ball31 roomb) (free right)
   goals met: 31 of 66
95. (drop ball32 roomb left)
   deleted: (carry ball32 left)
   added: (at ball32 roomb) (free left)
   goals met: 32 of 66
96. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 66
97. (pick ball33 rooma right)
   deleted: (at ball33 rooma) (free right)
   added: (carry ball33 right)
   goals met: 32 of 66
98. (pick ball34 rooma left)
   deleted: (at ball34 rooma) (free left)
   added: (carry ball34 left)
   goals met: 32 of 66
99. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 66
100. (drop ball33 roomb right)
   deleted: (carry ball33 right)
   added: (at ball33 roomb) (free right)
   goals met: 33 of 66
101. (drop ball34 roomb left)
   deleted: (carry ball34 left)
   added: (at ball34 roomb) (free left)
   goals met: 34 of 66
102. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 66
103. (pick ball35 rooma left)
   deleted: (at ball35 rooma) (free left)
   added: (carry ball35 left)
   goals met: 34 of 66
104. (pick ball36 rooma right)
   deleted: (at ball36 rooma) (free right)
   added: (carry ball36 right)
   goals met: 34 of 66
105. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 66
106. (drop ball35 roomb left)
   deleted: (carry ball35 left)
   added: (at ball35 roomb) (free left)
   goals met: 35 of 66
107. (drop ball36 roomb right)
   deleted: (carry ball36 right)
   added: (at ball36 roomb) (free right)
   goals met: 36 of 66
108. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 66
109. (pick ball37 rooma right)
   deleted: (at ball37 rooma) (free right)
   added: (carry ball37 right)
   goals met: 36 of 66
110. (pick ball38 rooma left)
   deleted: (at ball38 rooma) (free left)
   added: (carry ball38 left)
   goals met: 36 of 66
111. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 66
112. (drop ball37 roomb right)
   deleted: (carry ball37 right)
   added: (at ball37 roomb) (free right)
   goals met: 37 of 66
113. (drop ball38 roomb left)
   deleted: (carry ball38 left)
   added: (at ball38 roomb) (free left)
   goals met: 38 of 66
114. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 38 of 66
115. (pick ball39 rooma right)
   deleted: (at ball39 rooma) (free right)
   added: (carry ball39 right)
   goals met: 38 of 66
116. (pick ball40 rooma left)
   deleted: (at ball40 rooma) (free left)
   added: (carry ball40 left)
   goals met: 38 of 66
117. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 38 of 66
118. (drop ball39 roomb right)
   deleted: (carry ball39 right)
   added: (at ball39 roomb) (free right)
   goals met: 39 of 66
119. (drop ball40 roomb left)
   deleted: (carry ball40 left)
   added: (at ball40 roomb) (free left)
   goals met: 40 of 66
120. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 40 of 66
121. (pick ball41 rooma right)
   deleted: (at ball41 rooma) (free right)
   added: (carry ball41 right)
   goals met: 40 of 66
122. (pick ball42 rooma left)
   deleted: (at ball42 rooma) (free left)
   added: (carry ball42 left)
   goals met: 40 of 66
123. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 40 of 66
124. (drop ball41 roomb right)
   deleted: (carry ball41 right)
   added: (at ball41 roomb) (free right)
   goals met: 41 of 66
125. (drop ball42 roomb left)
   deleted: (carry ball42 left)
   added: (at ball42 roomb) (free left)
   goals met: 42 of 66
126. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 42 of 66
127. (pick ball43 rooma right)
   deleted: (at ball43 rooma) (free right)
   added: (carry ball43 right)
   goals met: 42 of 66
128. (pick ball44 rooma left)
   deleted: (at ball44 rooma) (free left)
   added: (carry ball44 left)
   goals met: 42 of 66
129. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 42 of 66
130. (drop ball43 roomb right)
   deleted: (carry ball43 right)
   added: (at ball43 roomb) (free right)
   goals met: 43 of 66
131. (drop ball44 roomb left)
   deleted: (carry ball44 left)
   added: (at ball44 roomb) (free left)
   goals met: 44 of 66
132. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 44 of 66
133. (pick ball45 rooma right)
   deleted: (at ball45 rooma) (free right)
   added: (carry ball45 right)
   goals met: 44 of 66
134. (pick ball46 rooma left)
   deleted: (at ball46 rooma) (free left)
   added: (carry ball46 left)
   goals met: 44 of 66
135. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 44 of 66
136. (drop ball45 roomb right)
   deleted: (carry ball45 right)
   added: (at ball45 roomb) (free right)
   goals met: 45 of 66
137. (drop ball46 roomb left)
   deleted: (carry ball46 left)
   added: (at ball46 roomb) (free left)
   goals met: 46 of 66
138. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 46 of 66
139. (pick ball47 rooma right)
   deleted: (at ball47 rooma) (free right)
   added: (carry ball47 right)
   goals met: 46 of 66
140. (pick ball48 rooma left)
   deleted: (at ball48 rooma) (free left)
   added: (carry ball48 left)
   goals met: 46 of 66
141. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 46 of 66
142. (drop ball47 roomb right)
   deleted: (carry ball47 right)
   added: (at ball47 roomb) (free right)
   goals met: 47 of 66
143. (drop ball48 roomb left)
   deleted: (carry ball48 left)
   added: (at ball48 roomb) (free left)
   goals met: 48 of 66
144. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 48 of 66
145. (pick ball49 rooma right)
   deleted: (at ball49 rooma) (free right)
   added: (carry ball49 right)
   goals met: 48 of 66
146. (pick ball50 rooma left)
   deleted: (at ball50 rooma) (free left)
   added: (carry ball50 left)
   goals met: 48 of 66
147. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 48 of 66
148. (drop ball49 roomb right)
   deleted: (carry ball49 right)
   added: (at ball49 roomb) (free right)
   goals met: 49 of 66
149. (drop ball50 roomb left)
   deleted: (carry ball50 left)
   added: (at ball50 roomb) (free left)
   goals met: 50 of 66
150. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 50 of 66
151. (pick ball51 rooma right)
   deleted: (at ball51 rooma) (free right)
   added: (carry ball51 right)
   goals met: 50 of 66
152. (pick ball52 rooma left)
   deleted: (at ball52 rooma) (free left)
   added: (carry ball52 left)
   goals met: 50 of 66
153. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 50 of 66
154. (drop ball51 roomb right)
   deleted: (carry ball51 right)
   added: (at ball51 roomb) (free right)
   goals met: 51 of 66
155. (drop ball52 roomb left)
   deleted: (carry ball52 left)
   added: (at ball52 roomb) (free left)
   goals met: 52 of 66
156. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 52 of 66
157. (pick ball53 rooma right)
   deleted: (at ball53 rooma) (free right)
   added: (carry ball53 right)
   goals met: 52 of 66
158. (pick ball54 rooma left)
   deleted: (at ball54 rooma) (free left)
   added: (carry ball54 left)
   goals met: 52 of 66
159. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 52 of 66
160. (drop ball53 roomb right)
   deleted: (carry ball53 right)
   added: (at ball53 roomb) (free right)
   goals met: 53 of 66
161. (drop ball54 roomb left)
   deleted: (carry ball54 left)
   added: (at ball54 roomb) (free left)
   goals met: 54 of 66
162. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 54 of 66
163. (pick ball55 rooma right)
   deleted: (at ball55 rooma) (free right)
   added: (carry ball55 right)
   goals met: 54 of 66
164. (pick ball56 rooma left)
   deleted: (at ball56 rooma) (free left)
   added: (carry ball56 left)
   goals met: 54 of 66
165. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 54 of 66
166. (drop ball55 roomb right)
   deleted: (carry ball55 right)
   added: (at ball55 roomb) (free right)
   goals met: 55 of 66
167. (drop ball56 roomb left)
   deleted: (carry ball56 left)
   added: (at ball56 roomb) (free left)
   goals met: 56 of 66
168. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 56 of 66
169. (pick ball57 rooma right)
   deleted: (at ball57 rooma) (free right)
   added: (carry ball57 right)
   goals met: 56 of 66
170. (pick ball58 rooma left)
   deleted: (at ball58 rooma) (free left)
   added: (carry ball58 left)
   goals met: 56 of 66
171. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 56 of 66
172. (drop ball57 roomb right)
   deleted: (carry ball57 right)
   added: (at ball57 roomb) (free right)
   goals met: 57 of 66
173. (drop ball58 roomb left)
   deleted: (carry ball58 left)
   added: (at ball58 roomb) (free left)
   goals met: 58 of 66
174. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 58 of 66
175. (pick ball59 rooma right)
   deleted: (at ball59 rooma) (free right)
   added: (carry ball59 right)
   goals met: 58 of 66
176. (pick ball60 rooma left)
   deleted: (at ball60 rooma) (free left)
   added: (carry ball60 left)
   goals met: 58 of 66
177. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 58 of 66
178. (drop ball59 roomb right)
   deleted: (carry ball59 right)
   added: (at ball59 roomb) (free right)
   goals met: 59 of 66
179. (drop ball60 roomb left)
   deleted: (carry ball60 left)
   added: (at ball60 roomb) (free left)
   goals met: 60 of 66
180. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 60 of 66
181. (pick ball61 rooma right)
   deleted: (at ball61 rooma) (free right)
   added: (carry ball61 right)
   goals met: 60 of 66
182. (pick ball62 rooma left)
   deleted: (at ball62 rooma) (free left)
   added: (carry ball62 left)
   goals met: 60 of 66
183. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 60 of 66
184. (drop ball61 roomb right)
   deleted: (carry ball61 right)
   added: (at ball61 roomb) (free right)
   goals met: 61 of 66
185. (drop ball62 roomb left)
   deleted: (carry ball62 left)
   added: (at ball62 roomb) (free left)
   goals met: 62 of 66
186. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 62 of 66
187. (pick ball63 rooma right)
   deleted: (at ball63 rooma) (free right)
   added: (carry ball63 right)
   goals met: 62 of 66
188. (pick ball64 rooma left)
   deleted: (at ball64 rooma) (free left)
   added: (carry ball64 left)
   goals met: 62 of 66
189. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 62 of 66
190. (drop ball63 roomb right)
   deleted: (carry ball63 right)
   added: (at ball63 roomb) (free right)
   goals met: 63 of 66
191. (drop ball64 roomb left)
   deleted: (carry ball64 left)
   added: (at ball64 roomb) (free left)
   goals met: 64 of 66
192. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 64 of 66
193. (pick ball65 rooma right)
   deleted: (at ball65 rooma) (free right)
   added: (carry ball65 right)
   goals met: 64 of 66
194. (pick ball66 rooma left)
   deleted: (at ball66 rooma) (free left)
   added: (carry ball66 left)
   goals met: 64 of 66
195. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 64 of 66
196. (drop ball65 roomb right)
   deleted: (carry ball65 right)
   added: (at ball65 roomb) (free right)
   goals met: 65 of 66
197. (drop ball66 roomb left)
   deleted: (carry ball66 left)
   added: (at ball66 roomb) (free left)
   goals met: 66 of 66
